:PROPERTIES:
:ID:       C28C4EAE-E86F-4788-B8FE-2A3F60CBE30B
:END:
#+title: org-modeとLiveCoding
#+filetags: :tidalcycles:org-mode:

#+begin_src elisp :results silent
  (setq org-image-actual-width nil)
  (org-toggle-inline-images)
#+end_src

*** [[id:48D91596-EF2D-4AEC-91D8-4731EDB69336][org-babel]]がすごい
- [[id:848FDA07-7706-4D0E-9A31-6C71D0F579A2][org-mode]]のコードブロックをそのまま実行できる機能

#+begin_src shell
echo "hello world!!!!"
#+end_src

#+RESULTS:
: hello world!!!!

#+name: categories
#+header: :engine postgres
#+header: :dbhost localhost :dbport 5433 :database app-db
#+header: :dbuser root :dbpassword password
#+begin_src sql
SELECT * FROM "Category";
#+end_src

#+tblname: categories-result
#+RESULTS: categories
| id | createdAt               | name       | label      | description | imageUrl                               |
|----+-------------------------+------------+------------+-------------+----------------------------------------|
|  1 | 2024-09-06 05:42:14.104 | flower     | 花          | description | http://127.0.0.1:9000/photos/00301.jpg |
|  2 | 2024-09-06 05:42:14.104 | ornament   | 雑貨        | description | http://127.0.0.1:9000/photos/00105.jpg |
|  3 | 2024-09-06 05:42:14.104 | vehicle    | 乗り物      | description | http://127.0.0.1:9000/photos/01517.jpg |
|  4 | 2024-09-06 05:42:14.104 | nature     | 自然        | description | http://127.0.0.1:9000/photos/00204.jpg |
|  5 | 2024-09-06 05:42:14.104 | animal     | 動物        | description | http://127.0.0.1:9000/photos/00901.jpg |
|  6 | 2024-09-06 05:42:14.104 | landscape  | 風景        | description | http://127.0.0.1:9000/photos/00705.jpg |
|  7 | 2024-09-06 05:42:14.104 | travel     | 旅行        | description | http://127.0.0.1:9000/photos/01510.jpg |
|  8 | 2024-09-06 05:42:14.104 | gourmet    | グルメ      | description | http://127.0.0.1:9000/photos/00500.jpg |
|  9 | 2024-09-06 05:42:14.104 | theme-park | テーマパーク | description | http://127.0.0.1:9000/photos/00210.jpg |

**** 結果を別のコードブロックの引数に渡して実行もできる！

#+header: :var result=categories-result
#+begin_src python :results output
  for row in result:
    print(f'[{row[0]}]: {row[3]}({row[2]})')
#+end_src

#+RESULTS:
: [1]: 花(flower)
: [2]: 雑貨(ornament)
: [3]: 乗り物(vehicle)
: [4]: 自然(nature)
: [5]: 動物(animal)
: [6]: 風景(landscape)
: [7]: 旅行(travel)
: [8]: グルメ(gourmet)
: [9]: テーマパーク(theme-park)


